;*****************************************************
;//////////////////Адреса функций/////////////////////
;*****************************************************

;****************Инициализация***********
hard_reset: 		equ 	C5DCH
iinchip_init: 		equ 	C68FH
init_w5100: 		equ 	B636H
;****************************************
IINCHIP_READ: 		equ 	C552H
IINCHIP_WRITE: 		equ 	C63BH
;*************Работа с сокетами**********
getSn_RX_RSR: 		equ 	BC21H;
getSn_SR:			equ		C671H
socket:  			equ 	B44DH;
close:				equ		C39AH;

recvfrom:			equ 	9B3FH
sendto:				equ 	ABE4H

connect:			equ		B1FEH;
recv:				equ 	BFEBH;
send:				equ		B330H;
disconnect:			equ		C4FEH;
listen:				equ		C1AAH;
;****************************************
;*********Чтение сетевых настроек********
getSIPR:			equ		C157H
getSUBR:			equ		C104H
getGAR:				equ		C0B1H
getDNSIP:			equ		C502H
getDNSIP2:			equ		C521H
;****************************************

;*************DHCP***********************
init_dhcpc_ch:		equ 	BAE1H
getIP_DHCPS:		equ		C31FH
check_DHCP_state: 	equ 	AF33H
T0_int:				equ		C2DCH
;****************************************

;*************DNS************************
gethostbyname:		equ 	BA3CH
setDNSIP:			equ 	C689H
;****************************************

;*****************************************************
;//////////////////Адреса данных/////////////////////
;*****************************************************
SRC_MAC_ADDR_0: 	equ 	FF17H
magik_buf:			equ 	FE6BH;
magik_buf_2:		equ 	FE4EH;

;*****************************************************
;/////////////Команды для сокетов w5100///////////////
;*****************************************************
Sn_MR_UDP: 			equ 	02h
Sn_MR_TCP: 			equ 	01h

;*****************************************************
;//////////////////Состояния сокета/////////////////////
;*****************************************************
SOCK_CLOSED: 		equ 	00h
SOCK_ESTABLISHED: 	equ		17H
SOCK_CLOSE_WAIT:  	equ		1CH

	

	
	
	
	
	
	
	